/*    */ package Enum;
/*    */ 
/*    */ import java.awt.Font;
/*    */ 
/*    */ 
/*    */ public enum Enum_Font_Ci
/*    */ {
/*  8 */   INFO("나눔바른고딕", 0, 20), 
/*  9 */   FONT22("나눔바른고딕", 0, 22), 
/* 10 */   FONT23("나눔바른고딕", 0, 23), 
/* 11 */   FONT26("나눔바른고딕", 0, 26), 
/* 12 */   DATEPICKER("나눔바른고딕", 0, 18), 
/* 13 */   나눔바른고딕14("나눔바른고딕", 0, 14), 
/* 14 */   나눔바른고딕15("나눔바른고딕", 0, 15), 
/* 15 */   나눔바른고딕16("나눔바른고딕", 0, 16), 
/* 16 */   나눔바른고딕17("나눔바른고딕", 0, 17), 
/* 17 */   나눔바른고딕18("나눔바른고딕", 0, 18), 
/* 18 */   나눔바른고딕19("나눔바른고딕", 0, 19), 
/* 19 */   나눔바른고딕20("나눔바른고딕", 0, 20), 
/* 20 */   나눔바른고딕21("나눔바른고딕", 0, 21), 
/* 21 */   나눔바른고딕22("나눔바른고딕", 0, 22), 
/* 22 */   나눔바른고딕23("나눔바른고딕", 0, 23), 
/* 23 */   나눔바른고딕24("나눔바른고딕", 0, 24), 
/* 24 */   나눔바른고딕25("나눔바른고딕", 0, 25), 
/* 25 */   나눔바른고딕26("나눔바른고딕", 0, 26), 
/* 26 */   나눔바른고딕27("나눔바른고딕", 0, 27), 
/* 27 */   나눔바른고딕28("나눔바른고딕", 0, 28), 
/* 28 */   나눔바른고딕29("나눔바른고딕", 0, 29), 
/* 29 */   나눔바른고딕30("나눔바른고딕", 0, 30), 
/* 30 */   나눔바른고딕31("나눔바른고딕", 0, 31);
/*    */   
/*    */   private final Font font;
/*    */   
/*    */   private Enum_Font_Ci(String fontName, int style, int size)
/*    */   {
/* 36 */     this.font = new Font(fontName, style, size);
/*    */   }
/*    */   
/*    */   public Font getFont()
/*    */   {
/* 41 */     return this.font;
/*    */   }
/*    */ }


/* Location:              C:\Users\Owner\Desktop\정다운마을 서버프로그램\!\Enum\Enum_Font_Ci.class
 * Java compiler version: 8 (52.0)
 * JD-Core Version:       0.7.1
 */